###################################################################

# Created by write_sdc on Sat Apr 26 10:27:52 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_wire_load_model -name 16000 -library saed32lvt_tt0p85v25c
set_max_transition 0.1 [current_design]
set_max_fanout 16 [current_design]
set_driving_cell -lib_cell NAND2X2_LVT -library saed32lvt_tt0p85v25c           \
[get_ports rst]
set_driving_cell -lib_cell NAND2X2_LVT -library saed32lvt_tt0p85v25c           \
[get_ports mem_data_valid]
set_driving_cell -lib_cell NAND2X2_LVT -library saed32lvt_tt0p85v25c           \
[get_ports {mem_data_in[15]}]
set_driving_cell -lib_cell NAND2X2_LVT -library saed32lvt_tt0p85v25c           \
[get_ports {mem_data_in[14]}]
set_driving_cell -lib_cell NAND2X2_LVT -library saed32lvt_tt0p85v25c           \
[get_ports {mem_data_in[13]}]
set_driving_cell -lib_cell NAND2X2_LVT -library saed32lvt_tt0p85v25c           \
[get_ports {mem_data_in[12]}]
set_driving_cell -lib_cell NAND2X2_LVT -library saed32lvt_tt0p85v25c           \
[get_ports {mem_data_in[11]}]
set_driving_cell -lib_cell NAND2X2_LVT -library saed32lvt_tt0p85v25c           \
[get_ports {mem_data_in[10]}]
set_driving_cell -lib_cell NAND2X2_LVT -library saed32lvt_tt0p85v25c           \
[get_ports {mem_data_in[9]}]
set_driving_cell -lib_cell NAND2X2_LVT -library saed32lvt_tt0p85v25c           \
[get_ports {mem_data_in[8]}]
set_driving_cell -lib_cell NAND2X2_LVT -library saed32lvt_tt0p85v25c           \
[get_ports {mem_data_in[7]}]
set_driving_cell -lib_cell NAND2X2_LVT -library saed32lvt_tt0p85v25c           \
[get_ports {mem_data_in[6]}]
set_driving_cell -lib_cell NAND2X2_LVT -library saed32lvt_tt0p85v25c           \
[get_ports {mem_data_in[5]}]
set_driving_cell -lib_cell NAND2X2_LVT -library saed32lvt_tt0p85v25c           \
[get_ports {mem_data_in[4]}]
set_driving_cell -lib_cell NAND2X2_LVT -library saed32lvt_tt0p85v25c           \
[get_ports {mem_data_in[3]}]
set_driving_cell -lib_cell NAND2X2_LVT -library saed32lvt_tt0p85v25c           \
[get_ports {mem_data_in[2]}]
set_driving_cell -lib_cell NAND2X2_LVT -library saed32lvt_tt0p85v25c           \
[get_ports {mem_data_in[1]}]
set_driving_cell -lib_cell NAND2X2_LVT -library saed32lvt_tt0p85v25c           \
[get_ports {mem_data_in[0]}]
set_load -pin_load 0.1 [get_ports mem_en]
set_load -pin_load 0.1 [get_ports {mem_addr[15]}]
set_load -pin_load 0.1 [get_ports {mem_addr[14]}]
set_load -pin_load 0.1 [get_ports {mem_addr[13]}]
set_load -pin_load 0.1 [get_ports {mem_addr[12]}]
set_load -pin_load 0.1 [get_ports {mem_addr[11]}]
set_load -pin_load 0.1 [get_ports {mem_addr[10]}]
set_load -pin_load 0.1 [get_ports {mem_addr[9]}]
set_load -pin_load 0.1 [get_ports {mem_addr[8]}]
set_load -pin_load 0.1 [get_ports {mem_addr[7]}]
set_load -pin_load 0.1 [get_ports {mem_addr[6]}]
set_load -pin_load 0.1 [get_ports {mem_addr[5]}]
set_load -pin_load 0.1 [get_ports {mem_addr[4]}]
set_load -pin_load 0.1 [get_ports {mem_addr[3]}]
set_load -pin_load 0.1 [get_ports {mem_addr[2]}]
set_load -pin_load 0.1 [get_ports {mem_addr[1]}]
set_load -pin_load 0.1 [get_ports {mem_addr[0]}]
set_load -pin_load 0.1 [get_ports mem_wr]
set_load -pin_load 0.1 [get_ports {mem_data_out[15]}]
set_load -pin_load 0.1 [get_ports {mem_data_out[14]}]
set_load -pin_load 0.1 [get_ports {mem_data_out[13]}]
set_load -pin_load 0.1 [get_ports {mem_data_out[12]}]
set_load -pin_load 0.1 [get_ports {mem_data_out[11]}]
set_load -pin_load 0.1 [get_ports {mem_data_out[10]}]
set_load -pin_load 0.1 [get_ports {mem_data_out[9]}]
set_load -pin_load 0.1 [get_ports {mem_data_out[8]}]
set_load -pin_load 0.1 [get_ports {mem_data_out[7]}]
set_load -pin_load 0.1 [get_ports {mem_data_out[6]}]
set_load -pin_load 0.1 [get_ports {mem_data_out[5]}]
set_load -pin_load 0.1 [get_ports {mem_data_out[4]}]
set_load -pin_load 0.1 [get_ports {mem_data_out[3]}]
set_load -pin_load 0.1 [get_ports {mem_data_out[2]}]
set_load -pin_load 0.1 [get_ports {mem_data_out[1]}]
set_load -pin_load 0.1 [get_ports {mem_data_out[0]}]
set_load -pin_load 0.1 [get_ports hlt]
set_load -pin_load 0.1 [get_ports {pc[15]}]
set_load -pin_load 0.1 [get_ports {pc[14]}]
set_load -pin_load 0.1 [get_ports {pc[13]}]
set_load -pin_load 0.1 [get_ports {pc[12]}]
set_load -pin_load 0.1 [get_ports {pc[11]}]
set_load -pin_load 0.1 [get_ports {pc[10]}]
set_load -pin_load 0.1 [get_ports {pc[9]}]
set_load -pin_load 0.1 [get_ports {pc[8]}]
set_load -pin_load 0.1 [get_ports {pc[7]}]
set_load -pin_load 0.1 [get_ports {pc[6]}]
set_load -pin_load 0.1 [get_ports {pc[5]}]
set_load -pin_load 0.1 [get_ports {pc[4]}]
set_load -pin_load 0.1 [get_ports {pc[3]}]
set_load -pin_load 0.1 [get_ports {pc[2]}]
set_load -pin_load 0.1 [get_ports {pc[1]}]
set_load -pin_load 0.1 [get_ports {pc[0]}]
create_clock [get_ports clk]  -period 100  -waveform {0 50}
set_clock_uncertainty 0.15  [get_clocks clk]
set_input_delay -clock clk  0.4  [get_ports rst]
set_input_delay -clock clk  0.4  [get_ports mem_data_valid]
set_input_delay -clock clk  0.4  [get_ports {mem_data_in[15]}]
set_input_delay -clock clk  0.4  [get_ports {mem_data_in[14]}]
set_input_delay -clock clk  0.4  [get_ports {mem_data_in[13]}]
set_input_delay -clock clk  0.4  [get_ports {mem_data_in[12]}]
set_input_delay -clock clk  0.4  [get_ports {mem_data_in[11]}]
set_input_delay -clock clk  0.4  [get_ports {mem_data_in[10]}]
set_input_delay -clock clk  0.4  [get_ports {mem_data_in[9]}]
set_input_delay -clock clk  0.4  [get_ports {mem_data_in[8]}]
set_input_delay -clock clk  0.4  [get_ports {mem_data_in[7]}]
set_input_delay -clock clk  0.4  [get_ports {mem_data_in[6]}]
set_input_delay -clock clk  0.4  [get_ports {mem_data_in[5]}]
set_input_delay -clock clk  0.4  [get_ports {mem_data_in[4]}]
set_input_delay -clock clk  0.4  [get_ports {mem_data_in[3]}]
set_input_delay -clock clk  0.4  [get_ports {mem_data_in[2]}]
set_input_delay -clock clk  0.4  [get_ports {mem_data_in[1]}]
set_input_delay -clock clk  0.4  [get_ports {mem_data_in[0]}]
set_output_delay -clock clk  0.5  [get_ports mem_en]
set_output_delay -clock clk  0.5  [get_ports {mem_addr[15]}]
set_output_delay -clock clk  0.5  [get_ports {mem_addr[14]}]
set_output_delay -clock clk  0.5  [get_ports {mem_addr[13]}]
set_output_delay -clock clk  0.5  [get_ports {mem_addr[12]}]
set_output_delay -clock clk  0.5  [get_ports {mem_addr[11]}]
set_output_delay -clock clk  0.5  [get_ports {mem_addr[10]}]
set_output_delay -clock clk  0.5  [get_ports {mem_addr[9]}]
set_output_delay -clock clk  0.5  [get_ports {mem_addr[8]}]
set_output_delay -clock clk  0.5  [get_ports {mem_addr[7]}]
set_output_delay -clock clk  0.5  [get_ports {mem_addr[6]}]
set_output_delay -clock clk  0.5  [get_ports {mem_addr[5]}]
set_output_delay -clock clk  0.5  [get_ports {mem_addr[4]}]
set_output_delay -clock clk  0.5  [get_ports {mem_addr[3]}]
set_output_delay -clock clk  0.5  [get_ports {mem_addr[2]}]
set_output_delay -clock clk  0.5  [get_ports {mem_addr[1]}]
set_output_delay -clock clk  0.5  [get_ports {mem_addr[0]}]
set_output_delay -clock clk  0.5  [get_ports mem_wr]
set_output_delay -clock clk  0.5  [get_ports {mem_data_out[15]}]
set_output_delay -clock clk  0.5  [get_ports {mem_data_out[14]}]
set_output_delay -clock clk  0.5  [get_ports {mem_data_out[13]}]
set_output_delay -clock clk  0.5  [get_ports {mem_data_out[12]}]
set_output_delay -clock clk  0.5  [get_ports {mem_data_out[11]}]
set_output_delay -clock clk  0.5  [get_ports {mem_data_out[10]}]
set_output_delay -clock clk  0.5  [get_ports {mem_data_out[9]}]
set_output_delay -clock clk  0.5  [get_ports {mem_data_out[8]}]
set_output_delay -clock clk  0.5  [get_ports {mem_data_out[7]}]
set_output_delay -clock clk  0.5  [get_ports {mem_data_out[6]}]
set_output_delay -clock clk  0.5  [get_ports {mem_data_out[5]}]
set_output_delay -clock clk  0.5  [get_ports {mem_data_out[4]}]
set_output_delay -clock clk  0.5  [get_ports {mem_data_out[3]}]
set_output_delay -clock clk  0.5  [get_ports {mem_data_out[2]}]
set_output_delay -clock clk  0.5  [get_ports {mem_data_out[1]}]
set_output_delay -clock clk  0.5  [get_ports {mem_data_out[0]}]
set_output_delay -clock clk  0.5  [get_ports hlt]
set_output_delay -clock clk  0.5  [get_ports {pc[15]}]
set_output_delay -clock clk  0.5  [get_ports {pc[14]}]
set_output_delay -clock clk  0.5  [get_ports {pc[13]}]
set_output_delay -clock clk  0.5  [get_ports {pc[12]}]
set_output_delay -clock clk  0.5  [get_ports {pc[11]}]
set_output_delay -clock clk  0.5  [get_ports {pc[10]}]
set_output_delay -clock clk  0.5  [get_ports {pc[9]}]
set_output_delay -clock clk  0.5  [get_ports {pc[8]}]
set_output_delay -clock clk  0.5  [get_ports {pc[7]}]
set_output_delay -clock clk  0.5  [get_ports {pc[6]}]
set_output_delay -clock clk  0.5  [get_ports {pc[5]}]
set_output_delay -clock clk  0.5  [get_ports {pc[4]}]
set_output_delay -clock clk  0.5  [get_ports {pc[3]}]
set_output_delay -clock clk  0.5  [get_ports {pc[2]}]
set_output_delay -clock clk  0.5  [get_ports {pc[1]}]
set_output_delay -clock clk  0.5  [get_ports {pc[0]}]
set_false_path   -from [get_ports rst]
